Revit 2026 API

# WallFlip Method

---

The wall orientation will be flipped.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Flip()
```
```vb
Public Sub Flip
```
```cpp
public:
void Flip()
```
```fsharp
member Flip : unit -> unit
```

For curtain walls and stacked walls, flip won't change the wall orientation. [!:Autodesk::Revit::DB::Wall.Orientation].

#### Reference

Wall Class

Autodesk.Revit.DB Namespace